In [2]:
import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]

df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

Q.1

In [3]:
#Data of second row

df[['duration']]

   duration
0         2
1         3
2         6
3         4

Q.2

loc : loc function requires the column name present in dataFrame to extract the data

iloc : iloc requires the column indices as 0,1,2,..

Q.3

In [4]:
new_df = df.reindex([3,0,1,2])
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [5]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [6]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

loc : loc[2] gives the output based on reindex which contains index 2
    
iloc : olic[2] it starts from 0 and gives row present at original index 2

Q.4

In [7]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.826885  0.948951  0.797121  0.843325  0.239617  0.499503
2  0.532399  0.427854  0.338699  0.710638  0.651400  0.696600
3  0.169467  0.926819  0.376865  0.679862  0.973175  0.279433
4  0.141936  0.160220  0.370748  0.864386  0.632045  0.136803
5  0.965859  0.251060  0.524207  0.629167  0.563747  0.371516
6  0.680944  0.774415  0.417206  0.686957  0.517354  0.534199

In [8]:
#i)
df1['column_1'].mean()
df1['column_2'].mean()
df1['column_3'].mean()
df1['column_4'].mean()
df1['column_5'].mean()
df1['column_6'].mean()

0.4196758203071321

In [9]:
#ii)
df1['column_2'].std()

0.3469169646311342

Q.5

In [10]:
df1.loc[2, 'column_2'] = 'ABC'

In [11]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.826885  0.948951  0.797121  0.843325  0.239617  0.499503
2  0.532399       ABC  0.338699  0.710638  0.651400  0.696600
3  0.169467  0.926819  0.376865  0.679862  0.973175  0.279433
4  0.141936   0.16022  0.370748  0.864386  0.632045  0.136803
5  0.965859   0.25106  0.524207  0.629167  0.563747  0.371516
6  0.680944  0.774415  0.417206  0.686957  0.517354  0.534199

In [12]:
df1.loc[[1,3,4,5,6], 'column_2'].mean()

0.6122929677274354

Q.6

Window Function : The Window functions in Pandas are used to perform some sort of calculations across a set of rows that are interrelated with the current row. 
1. Aggregate
2. Ranking
3. Value

Q.7

In [13]:
from datetime import datetime

datetime.now().month
datetime.now().year

2023

Q.9

In [ ]:
file = input("Enter the file name : ")
col_name = input("Enter Column Name :")
Category_order = bool(int(input("Enter Category Order : 0=False or 1=True ")))

df1 = pd.read_csv(file)
s = pd.Categorical(df1[col_name], ordered=Category_order).sort_values()

pd.DataFrame(s)

Q.10

In [ ]:
file_path = input("Enter File Path : ")

d = pd.read_csv(file_path)
d.plot.bar(x='Products', y='Sales')
d.plot.bar()

Q.11

In [ ]:
file = input("Enter the file name : ")

df2 = pd.read_csv(file)

mean = df2['Test Score'].mean()
median = df2['Test Score'].median()
mode = list(df2['Test Score'].mode())[0]

pd.DataFrame({
    'Statistic' : ['Mean', 'Median', 'Mode'],
    'Value' : [mean, median, mode]
})

In [14]:
df3 = pd.DataFrame({
    'Student Id': [1,2,3,4,5,6,7,8,9,10],
    'Test Score': [85,90,80,75,85,82,78,85,90,85]
})

mean = df3['Test Score'].mean()
median = df3['Test Score'].median()
mode = list(df3['Test Score'].mode())[0]

pd.DataFrame({
    'Statistic' : ['Mean', 'Median', 'Mode'],
    'Value' : [mean, median, mode]
})

  Statistic  Value
0      Mean   83.5
1    Median   85.0
2      Mode   85.0